# Тема 9. Концепции и принципы ООП
Отчет по Теме №8 выполнил:
- Исаков Степан Юрьевич
- ИВТ-23-1

| Задание | Лаб_раб | Сам_раб |
| ------ | ------ | ------ |
| Задание 1 | + | + |
| Задание 2 | + |  |
| Задание 3 | + |  |
| Задание 4 | + |  |
| Задание 5 | + |  |

знак "+" - задание выполнено; знак "-" - задание не выполнено;

---

## Лабораторная работа №9
### Задание 1.



```python
```

### Результат

![Меню]()

### Вывод



### Задание 2.



```python
```

### Результат

![Меню]()

### Вывод



### Задание 3.



```python
```

### Результат

![Меню]()

### Вывод



### Задание 4.



```python
```

### Результат

![Меню]()

### Вывод



### Задание 5.



```python
```

### Результат

![Меню]()

### Вывод



---

## Самостоятельная работа №9
### Задание 1.



```python
```

### Результат

![Меню]()

### Вывод


