# Тема 7. Работа с файлами(ввод, вывод)
Отчет по Теме №7 выполнил:
- Исаков Степан Юрьевич
- ИВТ-23-1

| Задание | Лаб_раб | Сам_раб |
| ------ | ------ | ------ |
| Задание 1 | + | + |
| Задание 2 | + | + |
| Задание 3 | + | + |
| Задание 4 | + | + |
| Задание 5 | + | + |
| Задание 6 | + |  |
| Задание 7 | + |  |
| Задание 8 | + |  |
| Задание 9 | + |  |
| Задание 10 | + |  |

знак "+" - задание выполнено; знак "-" - задание не выполнено;

---

## Лабораторная работа №7
### Задание 1.



```python
```

### Результат

![Меню]()

### Вывод



### Задание 2.



```python
```

### Результат

![Меню]()

### Вывод



### Задание 3.



```python
```

### Результат

![Меню]()

### Вывод



### Задание 4.



```python
```

### Результат

![Меню]()

### Вывод



### Задание 5.



```python
```

### Результат

![Меню]()

### Вывод



### Задание 6.



```python
```

### Результат

![Меню]()

### Вывод



### Задание 7.



```python
```

### Результат

![Меню]()

### Вывод



### Задание 8.



```python
```

### Результат

![Меню]()

### Вывод



### Задание 9.



```python
```

### Результат

![Меню]()

### Вывод



### Задание 10.



```python
```

### Результат

![Меню]()

### Вывод



---

## Самостоятельная работа №7
### Задание 1.



```python
```

### Результат

![Меню]()

### Вывод



### Задание 2.



```python
```

### Результат

![Меню]()

### Вывод



### Задание 3.



```python
```

### Результат

![Меню]()

### Вывод



### Задание 4.



```python
```

### Результат

![Меню]()

### Вывод



### Задание 5.



```python
```

### Результат

![Меню]()

### Вывод
